{
  "query": [
    {
      "function": "above_top_solid",
      "documentation": "Returns the height of the block immediately above the highest solid block at the input (x,z) position"
    },
    { "function": "actor_count", "documentation": "Returns the number of actors rendered in the last frame" },
    {
      "function": "all_animations_finished",
      "documentation": "Only valid in an animation controller. Returns 1.0 if all animations in the current animation controller state have played through at least once, else it returns 0.0"
    },
    { "function": "all_tags", "documentation": "Returns if the item or block has all of the tags specified" },
    {
      "function": "anim_time",
      "documentation": "Returns the time in seconds since the current animation started, else 0.0 if not called within an animation"
    },
    {
      "function": "any_animation_finished",
      "documentation": "Only valid in an animation controller. Returns 1.0 if any animation in the current animation controller state has played through at least once, else it returns 0.0"
    },
    { "function": "any_tag", "documentation": "Returns if the item or block has any of the tags specified" },
    { "function": "approx_eq", "documentation": "Returns 1.0 if all of the arguments are within 0.000000 of each other, else 0.0" },
    {
      "function": "armor_color_slot",
      "documentation": "Takes the armor slot index as a parameter, and returns the color of the armor in the requested slot"
    },
    {
      "function": "armor_material_slot",
      "documentation": "Takes the armor slot index as a parameter, and returns the armor material type in the requested armor slot"
    },
    {
      "function": "armor_texture_slot",
      "documentation": "Takes the armor slot index as a parameter, and returns the texture type of the requested slot"
    },
    {
      "function": "average_frame_time",
      "documentation": "Returns the time in *seconds* of the average frame time over the last 'n' frames. If an argument is passed, it is assumed to be the number of frames in the past that you wish to query. `query.average_frame_time` (or the equivalent `query.average_frame_time(0)`) will return the frame time of the frame before the current one. `query.average_frame_time(1)` will return the average frame time of the previous two frames. Currently we store the history of the last 30 frames, although note that this may change in the future. Asking for more frames will result in only sampling the number of frames stored."
    },
    { "function": "block_property", "documentation": "Returns the value of the associated Blocks Block State" },
    { "function": "blocking", "documentation": "Returns 1.0 if the entity is blocking, else it returns 0.0" },
    { "function": "body_x_rotation", "documentation": "Returns the body pitch rotation if called on an actor, else it returns 0.0" },
    { "function": "body_y_rotation", "documentation": "Returns the body yaw rotation if called on an actor, else it returns 0.0" },
    {
      "function": "camera_distance_range_lerp",
      "documentation": "Takes two distances (any order) and return a number from 0 to 1 based on the camera distance between the two ranges clamped to that range. For example, `query.camera_distance_range_lerp(10, 20)` will return 0 for any distance less than or equal to 10, 0.2 for a distance of 12, 0.5 for 15, and 1 for 20 or greater. If you pass in (20, 10), a distance of 20 will return 0.0"
    },
    {
      "function": "camera_rotation",
      "documentation": "Returns the rotation of the camera. Requires one argument representing the rotation axis you would like (`0==x`, `1==y`)"
    },
    { "function": "can_climb", "documentation": "Returns 1.0 if the entity can climb, else it returns 0.0" },
    { "function": "can_fly", "documentation": "Returns 1.0 if the entity can fly, else it returns 0.0" },
    { "function": "can_power_jump", "documentation": "Returns 1.0 if the entity can power jump, else it returns 0.0" },
    { "function": "can_swim", "documentation": "Returns 1.0 if the entity can swim, else it returns 0.0" },
    { "function": "can_walk", "documentation": "Returns 1.0 if the entity can walk, else it returns 0.0" },
    {
      "function": "cape_flap_amount",
      "documentation": "returns value between 0.0 and 1.0 with 0.0 meaning cape is fully down and 1.0 is cape is fully up"
    },
    {
      "function": "cardinal_block_face_placed_on",
      "documentation": "Returns the block face that was placed on by the player (Down=0.0, Up=1.0, North=2.0, South=3.0, West=4.0, East=5.0, Undefined=6.0)."
    },
    {
      "function": "cardinal_player_facing",
      "documentation": "Returns the current facing of the player (Down=0.0, Up=1.0, North=2.0, South=3.0, West=4.0, East=5.0, Undefined=6.0)."
    },
    {
      "function": "combine_entities",
      "documentation": "Combines any valid entity references from all arguments into a single array. Note that order is not preserved, and duplicates and invalid values are removed."
    },
    {
      "function": "count",
      "documentation": "Counts the number of things passed to it (arrays are counted as the number of elements they contain; non-arrays count as 1)."
    },
    { "function": "current_squish_value", "documentation": "Returns the squish value for the current entity, or 0.0 if this doesn't make sense" },
    { "function": "day", "documentation": "Returns the day of the current level." },
    { "function": "debug_output", "documentation": "debug log a value to the output debug window for builds that have one" },
    { "function": "delta_time", "documentation": "Returns the time in seconds since the previous frame" },
    { "function": "distance_from_camera", "documentation": "Returns the distance of the root of this actor or particle emitter from the camera" },
    { "function": "effect_emitter_count", "documentation": "Returns the total number of active emitters of the callee's particle effect type" },
    { "function": "effect_particle_count", "documentation": "Returns the total number of active particles of the callee's particle effect type" },
    { "function": "equipment_count", "documentation": "returns the equipment count for an actor" },
    {
      "function": "equipped_item_all_tags",
      "documentation": "takes a slot name followed by any tag you want to check for in the form of 'tag_name' and returns 1 if all of the tags are on that equipped item, 0 otherwise"
    },
    {
      "function": "equipped_item_any_tag",
      "documentation": "takes a slot name followed by any tag you want to check for in the form of 'tag_name' and returns 0 if none of the tags are on that equipped item or 1 if at least 1 tag exists"
    },
    { "function": "eye_target_x_rotation", "documentation": "returns the X eye rotation of the entity if it makes sense, else it returns 0.0" },
    { "function": "eye_target_y_rotation", "documentation": "returns the Y eye rotation of the entity if it makes sense, else it returns 0.0" },
    { "function": "frame_alpha", "documentation": "Returns the ratio (from 0 to 1) of how much between AI ticks this frame is being rendered" },
    { "function": "get_actor_info_id", "documentation": "Returns the integer id of an actor by its string name" },
    {
      "function": "get_equipped_item_name",
      "documentation": "takes one optional hand slot as a parameter (0 or 'main_hand' for main hand, 1 or 'off_hand' for off hand), and a second parameter (0=default) if you would like the equipped item or any non-zero number for the currently rendered item, and returns the name of the item in the requested slot (defaulting to the main hand if no parameter is supplied) if there is one, otherwise returns ''."
    },
    { "function": "get_locator_offset", "documentation": "Gets specified axis of the specified locator offset" },
    { "function": "get_name", "documentation": "get the name of the mob if there is one, otherwise return ''" },
    { "function": "get_root_locator_offset", "documentation": "Gets specified axis of the specified locator offset of the root model" },
    { "function": "ground_speed", "documentation": "Returns the ground speed of the entity in metres/second" },
    { "function": "has_any_family", "documentation": "Returns 1 if the entity has any of the specified families, else 0." },
    {
      "function": "has_armor_slot",
      "documentation": "Takes the armor slot index as a parameter, and returns 1.0 if the entity has armor in the requested slot, else it returns 0.0"
    },
    { "function": "has_biome_tag", "documentation": "Returns whether or not a Block Placement Target has a specific biome tag" },
    { "function": "has_block_property", "documentation": "Returns 1.0 if the associated block has the given block property or 0.0 if not" },
    { "function": "has_cape", "documentation": "Returns 1.0 if the player has a cape, else it returns 0.0" },
    { "function": "has_collision", "documentation": "Returns 1.0 if the entity has collisions enabled, else it returns 0.0" },
    { "function": "has_gravity", "documentation": "Returns 1.0 if the entity is affected by gravity, else it returns 0.0" },
    { "function": "has_owner", "documentation": "Returns true if the entity has an owner ID else it returns false" },
    { "function": "has_rider", "documentation": "Returns 1.0 if the entity has a rider, else it returns 0.0" },
    { "function": "has_target", "documentation": "Returns 1.0 if the entity has a target, else it returns 0.0" },
    { "function": "head_roll_angle", "documentation": "returns the roll angle of the head of the entity if it makes sense, else it returns 0.0" },
    {
      "function": "head_x_rotation",
      "documentation": "Takes one argument as a parameter. Returns the nth head x rotation of the entity if it makes sense, else it returns 0.0"
    },
    {
      "function": "head_y_rotation",
      "documentation": "Takes one argument as a parameter. Returns the nth head y rotation of the entity if it makes sense, else it returns 0.0"
    },
    { "function": "health", "documentation": "Returns the health of the entity, or 0.0 if it doesn't make sense to call on this entity." },
    { "function": "heightmap", "documentation": "Queries Height Map" },
    { "function": "hurt_direction", "documentation": "returns the hurt direction for the actor, otherwise returns 0" },
    { "function": "hurt_time", "documentation": "returns the hurt time for the actor, otherwise returns 0" },
    {
      "function": "invulnerable_ticks",
      "documentation": "Returns the number of ticks of invulnerability the entity has left if it makes sense, else it returns 0.0"
    },
    { "function": "is_admiring", "documentation": "Returns 1.0 if the entity is admiring, else it returns 0.0" },
    { "function": "is_alive", "documentation": "returns 1.0 if the entity is alive, and 0.0 if it's dead" },
    { "function": "is_angry", "documentation": "Returns 1.0 if the entity is angry, else it returns 0.0" },
    { "function": "is_attached_to_entity", "documentation": "Returns 1.0 if the actor is attached to an entity, else it will return 0.0" },
    { "function": "is_avoiding_block", "documentation": "Returns 1.0 if the entity is fleeing from a block, else it returns 0.0" },
    { "function": "is_avoiding_mobs", "documentation": "Returns 1.0 if the entity is fleeing from mobs, else it returns 0.0" },
    { "function": "is_baby", "documentation": "Returns 1.0 if the entity is a baby, else it returns 0.0" },
    { "function": "is_breathing", "documentation": "Returns 1.0 if the entity is breathing, else it returns 0.0" },
    { "function": "is_bribed", "documentation": "Returns 1.0 if the entity has been bribed, else it returns 0.0" },
    { "function": "is_carrying_block", "documentation": "Returns 1.0 if the entity is carrying a block, else it returns 0.0" },
    { "function": "is_casting", "documentation": "Returns 1.0 if the entity is casting, else it returns 0.0" },
    { "function": "is_celebrating", "documentation": "Returns 1.0 if the entity is celebrating, else it returns 0.0" },
    { "function": "is_celebrating_special", "documentation": "Returns 1.0 if the entity is doing a special celebration, else it returns 0.0" },
    { "function": "is_charged", "documentation": "Returns 1.0 if the entity is charged, else it returns 0.0" },
    { "function": "is_charging", "documentation": "Returns 1.0 if the entity is charging, else it returns 0.0" },
    { "function": "is_chested", "documentation": "Returns 1.0 if the entity has chests attached to it, else it returns 0.0" },
    { "function": "is_critical", "documentation": "Returns 1.0 if the entity is critical, else it returns 0.0" },
    { "function": "is_dancing", "documentation": "Returns 1.0 if the entity is dancing, else it returns 0.0" },
    { "function": "is_delayed_attacking", "documentation": "returns 1.0 if the entity is attacking using the delayed attack, else it returns 0.0" },
    { "function": "is_eating", "documentation": "Returns 1.0 if the entity is eating, else it returns 0.0" },
    { "function": "is_elder", "documentation": "Returns 1.0 if the entity is an elder version of it, else it returns 0.0" },
    { "function": "is_emoting", "documentation": "Returns 1.0 if the entity is emoting, else it returns 0.0" },
    { "function": "is_enchanted", "documentation": "Returns 1.0 if the entity is enchanted, else it returns 0.0" },
    { "function": "is_fire_immune", "documentation": "Returns 1.0 if the entity is immune to fire, else it returns 0.0" },
    { "function": "is_first_person", "documentation": "Returns 1.0 if the entity is being rendered in first person mode, else it returns 0.0" },
    { "function": "is_ghost", "documentation": "returns 1.0 if an entity is a ghost, else it returns 0.0" },
    { "function": "is_gliding", "documentation": "Returns 1.0 if the entity is gliding, else it returns 0.0" },
    { "function": "is_grazing", "documentation": "Returns 1.0 if the entity is grazing, or 0.0 if not" },
    { "function": "is_idling", "documentation": "Returns 1.0 if the entity is idling, else it returns 0.0" },
    { "function": "is_ignited", "documentation": "Returns 1.0 if the entity is ignited, else it returns 0.0" },
    { "function": "is_illager_captain", "documentation": "Returns 1.0 if the entity is an illager captain, else it returns 0.0" },
    { "function": "is_in_love", "documentation": "Returns 1.0 if the entity is in love, else it returns 0.0" },
    { "function": "is_in_ui", "documentation": "Returns 1.0 if the entity is rendered as part of the UI, else it returns 0.0" },
    { "function": "is_in_water", "documentation": "Returns 1.0 if the entity is in water, else it returns 0.0" },
    { "function": "is_in_water_or_rain", "documentation": "Returns 1.0 if the entity is in water or rain, else it returns 0.0" },
    { "function": "is_interested", "documentation": "Returns 1.0 if the entity is interested, else it returns 0.0" },
    { "function": "is_invisible", "documentation": "Returns 1.0 if the entity is invisible, else it returns 0.0" },
    {
      "function": "is_item_equipped",
      "documentation": "takes one optional hand slot as a parameter (0 or 'main_hand' for main hand, 1 or 'off_hand' for off hand), and returns 1.0 if there is an item in the requested slot (defaulting to the main hand if no parameter is supplied), otherwise returns 0.0."
    },
    { "function": "is_jumping", "documentation": "Returns 1.0 if the entity is in water or rain, else it returns 0.0" },
    { "function": "is_laying_down", "documentation": "Returns 1.0 if the entity is laying down, else it returns 0.0" },
    { "function": "is_laying_egg", "documentation": "Returns 1.0 if the entity is laying an egg, else it returns 0.0" },
    { "function": "is_leashed", "documentation": "Returns 1.0 if the entity is leashed to something, else it returns 0.0" },
    { "function": "is_levitating", "documentation": "Returns 1.0 if the entity is levitating, else it returns 0.0" },
    { "function": "is_lingering", "documentation": "Returns 1.0 if the entity is lingering, else it returns 0.0" },
    { "function": "is_moving", "documentation": "Returns 1.0 if the entity is moving, else it returns 0.0" },
    { "function": "is_on_fire", "documentation": "returns 1.0 if the entity is on fire, else it returns 0.0" },
    { "function": "is_on_ground", "documentation": "Returns 1.0 if the entity is on the ground, else it returns 0.0" },
    {
      "function": "is_on_screen",
      "documentation": "returns 1.0 if this is called on an entity at a time when it is known if it is on screen, else it returns 0.0"
    },
    { "function": "is_onfire", "documentation": "Returns 1.0 if the entity is on fire, else it returns 0.0" },
    { "function": "is_orphaned", "documentation": "Returns 1.0 if the entity is orphaned, else it returns 0.0" },
    { "function": "is_persona_or_premium_skin", "documentation": "Returns 1.0 if the player has a persona or permium skin, else it returns 0.0" },
    { "function": "is_powered", "documentation": "Returns 1.0 if the entity is powered, else it returns 0.0" },
    { "function": "is_pregnant", "documentation": "Returns 1.0 if the entity is pregnant, else it returns 0.0" },
    { "function": "is_resting", "documentation": "Returns 1.0 if the entity is resting, else it returns 0.0" },
    { "function": "is_riding", "documentation": "Returns 1.0 if the entity is riding, else it returns 0.0" },
    { "function": "is_roaring", "documentation": "returns 1.0 if the entity is currently roaring, else it returns 0.0" },
    { "function": "is_rolling", "documentation": "Returns 1.0 if the entity is rolling, else it returns 0.0" },
    { "function": "is_saddled", "documentation": "Returns 1.0 if the entity has a saddle, else it returns 0.0" },
    { "function": "is_scared", "documentation": "Returns 1.0 if the entity is scared, else it returns 0.0" },
    { "function": "is_selected_item", "documentation": "returns true if the player has selected an item in the inventory, else it returns 0.0" },
    { "function": "is_shaking", "documentation": "Returns 1.0 if the entity is casting, else it returns 0.0" },
    { "function": "is_shaking_wetness", "documentation": "returns 1.0 if the entity is shaking water off, else it returns 0.0" },
    { "function": "is_sheared", "documentation": "Returns 1.0 if the entity is able to be sheared and is sheared, else it returns 0.0" },
    {
      "function": "is_shield_powered",
      "documentation": "Returns 1.0f if the entity has an active powered shield if it makes sense, else it returns 0.0"
    },
    { "function": "is_silent", "documentation": "Returns 1.0 if the entity is silent, else it returns 0.0" },
    { "function": "is_sitting", "documentation": "Returns 1.0 if the entity is sitting, else it returns 0.0" },
    { "function": "is_sleeping", "documentation": "Returns 1.0 if the entity is sleeping, else it returns 0.0" },
    { "function": "is_sneaking", "documentation": "Returns 1.0 if the entity is sneaking, else it returns 0.0" },
    { "function": "is_sneezing", "documentation": "Returns 1.0 if the entity is sneezing, else it returns 0.0" },
    { "function": "is_sprinting", "documentation": "Returns 1.0 if the entity is sprinting, else it returns 0.0" },
    { "function": "is_stackable", "documentation": "Returns 1.0 if the entity is stackable, else it returns 0.0" },
    { "function": "is_stalking", "documentation": "Returns 1.0 if the entity is stalking, else it returns 0.0" },
    { "function": "is_standing", "documentation": "Returns 1.0 if the entity is standing, else it returns 0.0" },
    { "function": "is_stunned", "documentation": "returns 1.0 if the entity is currently stunned, else it returns 0.0" },
    { "function": "is_swimming", "documentation": "Returns 1.0 if the entity is swimming, else it returns 0.0" },
    { "function": "is_tamed", "documentation": "Returns 1.0 if the entity is tamed, else it returns 0.0" },
    { "function": "is_transforming", "documentation": "Returns 1.0 if the entity is transforming, else it returns 0.0" },
    { "function": "is_using_item", "documentation": "Returns 1.0 if the entity is using an item, else it returns 0.0" },
    { "function": "is_wall_climbing", "documentation": "Returns 1.0 if the entity is climbing a wall, else it returns 0.0" },
    {
      "function": "item_in_use_duration",
      "documentation": "Returns the amount of time an item has been in use in seconds up to the maximum duration, else 0.0 if it doesn't make sense"
    },
    {
      "function": "item_is_charged",
      "documentation": "takes one optional hand slot as a parameter (0 or 'main_hand' for main hand, 1 or 'off_hand' for off hand), and returns 1.0 if the item is charged in the requested slot (defaulting to the main hand if no parameter is supplied), otherwise returns 0.0."
    },
    {
      "function": "item_max_use_duration",
      "documentation": "Returns the maximum amount of time the item can be used, else 0.0 if it doesn't make sense"
    },
    {
      "function": "item_remaining_use_duration",
      "documentation": "Returns the amount of time an item has left to use in seconds, else 0.0 if it doesn't make sense"
    },
    { "function": "key_frame_lerp_time", "documentation": "Returns the ratio between the previous and next key frames" },
    {
      "function": "last_frame_time",
      "documentation": "Returns the time in *seconds* of the last frame. If an argument is passed, it is assumed to be the number of frames in the past that you wish to query. `query.last_frame_time` (or the equivalent `query.last_frame_time(0)`) will return the frame time of the frame before the current one. `query.last_frame_time(1)` will return the frame time of two frames ago. Currently we store the history of the last 30 frames, although note that this may change in the future. Passing an index more than the available data will return the oldest frame stored."
    },
    {
      "function": "last_hit_by_player",
      "documentation": "Returns 1.0 if the entity was last hit by the player, else it returns 0.0. If called by the client always returns 0.0"
    },
    { "function": "lie_amount", "documentation": "Returns the lie down amount for the entity" },
    { "function": "life_span", "documentation": "returns the limited life span of an entity, or 0.0 if it lives forever" },
    {
      "function": "life_time",
      "documentation": "Returns the time in seconds since the current animation started, else 0.0 if not called within an animation"
    },
    {
      "function": "lod_index",
      "documentation": "Takes an array of distances and returns the zero - based index of which range the actor is in based on distance from the camera.For example, `query.lod_index(10, 20, 30)` will return 0, 1, or 2 based on whether the mob is less than 10, 20, or 30 units away from the camera, or it will return 3 if it is greater than 30."
    },
    { "function": "log", "documentation": "debug log a value to the content log" },
    {
      "function": "main_hand_item_max_duration",
      "documentation": "Returns the use time maximum duration for the main hand item if it makes sense, else it returns 0.0"
    },
    { "function": "main_hand_item_use_duration", "documentation": "Returns the use time for the main hand item." },
    { "function": "mark_variant", "documentation": "Returns the entity's mark variant" },
    { "function": "max_durability", "documentation": "Returns the max durability an item can take" },
    {
      "function": "max_health",
      "documentation": "Returns the maximum health of the entity, or 0.0 if it doesn't make sense to call on this entity."
    },
    { "function": "max_trade_tier", "documentation": "Returns the maximum trade tier of the entity if it makes sense, else it returns 0.0" },
    {
      "function": "maximum_frame_time",
      "documentation": "Returns the time in *seconds* of the most expensive frame over the last 'n' frames. If an argument is passed, it is assumed to be the number of frames in the past that you wish to query. `query.maximum_frame_time` (or the equivalent `query.maximum_frame_time(0)`) will return the frame time of the frame before the current one. `query.maximum_frame_time(1)` will return the maximum frame time of the previous two frames. Currently we store the history of the last 30 frames, although note that this may change in the future. Asking for more frames will result in only sampling the number of frames stored."
    },
    {
      "function": "minimum_frame_time",
      "documentation": "Returns the time in *seconds* of the least expensive frame over the last 'n' frames. If an argument is passed, it is assumed to be the number of frames in the past that you wish to query. `query.minimum_frame_time` (or the equivalent `query.minimum_frame_time(0)`) will return the frame time of the frame before the current one. `query.minimum_frame_time(1)` will return the minimum frame time of the previous two frames. Currently we store the history of the last 30 frames, although note that this may change in the future. Asking for more frames will result in only sampling the number of frames stored."
    },
    { "function": "model_scale", "documentation": "Returns the scale of the current entity" },
    {
      "function": "modified_distance_moved",
      "documentation": "Returns the total distance the entity has moved horizontally in meters (since the entity was last loaded, not necessarily since it was originally created) modified along the way by status flags such as is_baby or on_fire"
    },
    {
      "function": "modified_move_speed",
      "documentation": "Returns the current walk speed of the entity modified by status flags such as is_baby or on_fire"
    },
    {
      "function": "moon_brightness",
      "documentation": "Returns the brightness of the moon (FULL_MOON=1.0, WANING_GIBBOUS=0.75, FIRST_QUARTER=0.5, WANING_CRESCENT=0.25, NEW_MOON=0.0, WAXING_CRESCENT=0.25, LAST_QUARTER=0.5, WAXING_GIBBOUS=0.75)."
    },
    {
      "function": "moon_phase",
      "documentation": "Returns the phase of the moon (FULL_MOON=0, WANING_GIBBOUS=1, FIRST_QUARTER=2, WANING_CRESCENT=3, NEW_MOON=4, WAXING_CRESCENT=5, LAST_QUARTER=6, WAXING_GIBBOUS=7)."
    },
    { "function": "movement_direction", "documentation": "returns the specified axis of the normalized position delta of the entity" },
    { "function": "noise", "documentation": "Queries Perlin Noise Map" },
    { "function": "on_fire_time", "documentation": "returns the time that the entity is on fire, else it returns 0.0" },
    { "function": "out_of_control", "documentation": "Returns 1.0 if the entity is out of control, else it returns 0.0" },
    { "function": "overlay_alpha", "documentation": "Do not use - this function is deprecated and will be removed" },
    { "function": "owner_identifier", "documentation": "Returns the root actor identifier" },
    { "function": "player_level", "documentation": "returns the players level if the actor is a player, otherwise returns 0" },
    {
      "function": "position",
      "documentation": "Returns the absolute position of an actor. Takes one argument that represents the desired axis (0 == x-axis, 1 == y-axis, 2 == z-axis)."
    },
    {
      "function": "position_delta",
      "documentation": "Returns the position delta for an actor. Takes one argument that represents the desired axis (0 == x-axis, 1 == y-axis, 2 == z-axis)."
    },
    {
      "function": "previous_squish_value",
      "documentation": "Returns the previous squish value for the current entity, or 0.0 if this doesn't make sense"
    },
    { "function": "remaining_durability", "documentation": "Returns the how much durability an item has remaining" },
    { "function": "roll_counter", "documentation": "Returns the roll counter of the entity" },
    {
      "function": "rotation_to_camera",
      "documentation": "Returns the rotation required to aim at the camera. Requires one argument representing the rotation axis you would like (`0==x`, `1==y`)"
    },
    { "function": "shake_angle", "documentation": "returns the shaking angle of the entity if it makes sense, else it returns 0.0" },
    { "function": "shake_time", "documentation": "Returns the shake time of the entity." },
    { "function": "sit_amount", "documentation": "Returns the current sit amount of the entity" },
    { "function": "skin_id", "documentation": "Returns the entity's skin ID" },
    { "function": "sleep_rotation", "documentation": "returns the rotation of the bed the player is sleeping on." },
    { "function": "sneeze_counter", "documentation": "Returns the sneeze counter of the entity" },
    { "function": "spellcolor", "documentation": "Returns the entity spell colour if it makes sense, else it returns 0.0" },
    { "function": "standing_scale", "documentation": "Returns the scale of how standing up the entity is" },
    { "function": "structural_integrity", "documentation": "returns the structural integrity for the actor, otherwise returns 0" },
    { "function": "swell_amount", "documentation": "Returns how swollen the entity is" },
    { "function": "swelling_dir", "documentation": "Returns the swelling direction of the entity if it makes sense, else it returns 0.0" },
    { "function": "swim_amount", "documentation": "Returns the amount the current entity is swimming" },
    { "function": "tail_angle", "documentation": "returns the angle of the tail of the entity if it makes sense, else it returns 0.0" },
    {
      "function": "target_x_rotation",
      "documentation": "Returns the x rotation required to aim at the entity's current target if it has one, else it returns 0.0"
    },
    {
      "function": "target_y_rotation",
      "documentation": "Returns the y rotation required to aim at the entity's current target if it has one, else it returns 0.0"
    },
    { "function": "texture_frame_index", "documentation": "Returns the icon index of the experience orb" },
    {
      "function": "time_of_day",
      "documentation": "Returns the time of day (midnight=0.0, sunrise=0.25, noon=0.5, sunset=0.75) of the dimension the entity is in."
    },
    { "function": "time_stamp", "documentation": "Returns the current time stamp of the level" },
    { "function": "total_emitter_count", "documentation": "Returns the total number of active emitters in the world" },
    { "function": "total_particle_count", "documentation": "Returns the total number of active particles in the world" },
    { "function": "trade_tier", "documentation": "Returns the trade tier of the entity if it makes sense, else it returns 0.0" },
    { "function": "unhappy_counter", "documentation": "Returns how unhappy the entity is" },
    { "function": "variant", "documentation": "Returns the entity's variant index" },
    { "function": "vertical_speed", "documentation": "Returns the speed of the entity up or down in metres/second, where positive is up" },
    { "function": "walk_distance", "documentation": "Returns the walk distance of the entity." },
    { "function": "wing_flap_position", "documentation": "Returns the wing flap position of the entity, or 0.0 if this doesn't make sense" },
    { "function": "wing_flap_speed", "documentation": "Returns the wing flap speed of the entity, or 0.0 if this doesn't make sense" },
    { "function": "yaw_speed", "documentation": "Returns the entity's yaw speed" }
  ],
  "math": [
    { "function": "abs(value)", "documentation": "Absolute value of value" },
    { "function": "acos(value)", "documentation": "arccos of value" },
    { "function": "asin(value)", "documentation": "arcsin of value" },
    { "function": "atan(value)", "documentation": "arctan of value" },
    { "function": "atan2(y, x)", "documentation": "arctan of y/x. NOTE: the order of arguments!" },
    { "function": "ceil(value)", "documentation": "Round value up to nearest integral number" },
    { "function": "clamp(value, min, max)", "documentation": "Clamp value to between min and max inclusive" },
    { "function": "cos(value)", "documentation": "Cosine (in degrees) of value" },
    {
      "function": "die_roll(num, low, high)",
      "documentation": "returns the sum of 'num' random numbers, each with a value from low to high`. Note: the generated random numbers are not integers like normal dice. For that, use die_roll_integer`."
    },
    {
      "function": "die_roll_integer(num, low, high)",
      "documentation": "returns the sum of 'num' random integer numbers, each with a value from low to high`. Note: the generated random numbers are integers like normal dice."
    },
    { "function": "exp(value)", "documentation": "Calculates e to the value'th power" },
    { "function": "floor(value)", "documentation": "Round value down to nearest integral number" },
    {
      "function": "hermite_blend(value)",
      "documentation": "Useful for simple smooth curve interpolation using one of the Hermite Basis functions: `3t^2 - 2t^3`. Note that while any valid float is a valid input, this function works best in the range [0,1]."
    },
    { "function": "lerp(start, end, 0_to_1)", "documentation": "Lerp from start to end via 0_to_1" },
    {
      "function": "lerprotate(start, end, 0_to_1)",
      "documentation": "Lerp the shortest direction around a circle from start degrees to end degrees via 0_to_1"
    },
    { "function": "ln(value)", "documentation": "Natural logarithm of value" },
    { "function": "max(A, B)", "documentation": "Return highest value of A or B" },
    { "function": "min(A, B)", "documentation": "Return lowest value of A or B" },
    { "function": "mod(value, denominator)", "documentation": "Return the remainder of value / denominator" },
    { "function": "pi", "documentation": "Returns the float representation of the constant pi." },
    { "function": "pow(base, exponent)", "documentation": "Elevates `base` to the `exponent`'th power" },
    { "function": "random(low, high)", "documentation": "Random value between low and high inclusive" },
    { "function": "random_integer(low, high)", "documentation": "Random integer value between low and high inclusive" },
    { "function": "round(value)", "documentation": "Round value to nearest integral number" },
    { "function": "sin(value)", "documentation": "Sine (in degrees) of value" },
    { "function": "sqrt(value)", "documentation": "Square root of value" },
    { "function": "trunc(value)", "documentation": "Round value towards zero" }
  ],
  "entities": {
    "variable": [{ "function": "attack_time", "documentation": "" }]
  },
  "particles": {
    "variable": [
      { "function": "emitter_lifetime", "documentation": "" },
      { "function": "emitter_age", "documentation": "" },
      { "function": "emitter_random_1", "documentation": "" },
      { "function": "emitter_random_2", "documentation": "" },
      { "function": "emitter_random_3", "documentation": "" },
      { "function": "emitter_random_4", "documentation": "" },
      { "function": "particle_lifetime", "documentation": "" },
      { "function": "particle_age", "documentation": "" },
      { "function": "particle_random_1", "documentation": "" },
      { "function": "particle_random_2", "documentation": "" },
      { "function": "particle_random_3", "documentation": "" },
      { "function": "particle_random_4", "documentation": "" },
      { "function": "entity_scale", "documentation": "" }
    ]
  }
}
